cf/Documents/АктСверкиВзаиморасчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>АктСверкиВзаиморасчетов</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительОрганизации</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставительКонтрагента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>60</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокНаНачало</Name>
					<Comment>(Общ) Остаток на начало </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расхождение</Name>
					<Comment>(Общ) Остаток на конец</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверкаСогласована</Name>
					<Comment>Признак согласования сверки</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымОрганизации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистратор</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Comment>(Общ) Дебет: увеличение долга контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Comment>(Общ) Кредит: увеличение долга организации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоДаннымКонтрагента</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРегистратор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
								<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
								<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дебет</Name>
							<Comment>(Общ) Дебет: увеличение долга контрагента</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кредит</Name>
							<Comment>(Общ) Кредит: увеличение долга организации</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf/AccumulationRegisters/Взаиморасчеты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>Взаиморасчеты</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФормаОтношений</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ФормаОтношений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

cf/Enums/ВидыОперацийСписаниеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСписаниеДенежныхСредств</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОплатаПоставщику</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПокупателю</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеНалога</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РасчетыПоКредитамИЗаймам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасчетыСКонтрагентами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереводНаДругойСчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеЗП</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеречислениеПодотчетномуЛицу</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочееСписание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf/Documents/АктСверкиВзаиморасчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура УправлениеВидимостьюДоступностью()
	
	Элементы.ГруппаШапка.ТолькоПросмотр = Объект.СверкаСогласована;
	Элементы.Страницы.ТолькоПросмотр = Объект.СверкаСогласована;
	
КонецПроцедуры

// ТИПОВЫЕ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ФункцииФормДокументов.ЗаполнитьЗначенияПоУмолчанию(
					Объект,
					ФункцииФормДокументов.ПолучитьРеквизитыДокумента(Документы.АктСверкиВзаиморасчетов.ПустаяСсылка())
					);
		
	КонецЕсли;
	
	ДолгПарнера = ДенежныеСредства.ПолучитьДолгПартнера(Объект.Контрагент, Объект.Организация);
	
							
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

// ШАПКА

&НаКлиенте
Процедура СверкаСогласованаПриИзменении(Элемент)
	
	УправлениеВидимостьюДоступностью();
	
КонецПроцедуры

//&НаСервере
//Процедура УстановитьФильтрПоПартнеру()
//	
//	Если Объект.Партнер.Пустая() Тогда
//		
//		НовыйМассив = Новый Массив();
//		Элементы.Контрагент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
//		
//	Иначе
//		
//		НовыйМассив = Новый Массив();
//		НовыйМассив.Добавить(Новый СвязьПараметраВыбора("Отбор.Партнер", "Объект.Партнер"));
//		Элементы.Контрагент.СвязиПараметровВыбора = Новый ФиксированныйМассив(НовыйМассив);
//		
//	КонецЕсли;
//	
//КонецПроцедуры
//&НаСервере
//Процедура ПартнерПриИзмененииНаСервере()
//	
//	ФункцииФормДокументов.ПартнерПриИзменении(Объект);
//	УстановитьФильтрПоПартнеру();
//	
//	ДолгПарнера = ДенежныеСредства.ПолучитьДолгПартнера(Объект.Партнер, Объект.Организация);
//	
//КонецПроцедуры
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	ФункцииФормДокументов.КонтрагентПриИзменении(Объект);
	
	//УстановитьФильтрПоПартнеру();
	ДолгПарнера = ДенежныеСредства.ПолучитьДолгПартнера(Объект.Контрагент, Объект.Организация);
	
КонецПроцедуры
&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()

	ФункцииФормДокументов.ОрганизацияПриИзменении(Объект);
	
	ДолгПарнера = ДенежныеСредства.ПолучитьДолгПартнера(Объект.Контрагент, Объект.Организация);
	
КонецПроцедуры


&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	ОрганизацияПриИзмененииНаСервере();
	
КонецПроцедуры
//&НаКлиенте
//Процедура ПартнерПриИзменении(Элемент)
//	
//	ПартнерПриИзмененииНаСервере();
//	
//КонецПроцедуры
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	КонтрагентПриИзмененииНаСервере();
	
КонецПроцедуры

// ЗАПОЛНЕНИЕ

&НаСервере
Процедура ЗаполнитьТаблицуПоВзаиморасчетам()
	
	Запрос = Новый Запрос("
	|ВЫБРАТЬ СуммаНачальныйОстаток ОстатокНаНачало
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(
	|			&ДатаНач, 
	|			&ДатаКон,,, 
	|		Организация 	= &Организация И
	|		Контрагент 		= &Контрагент)
	|;
	|ВЫБРАТЬ
	|	Регистратор ДокументРегистратор,
	|	ПРЕДСТАВЛЕНИЕ(Регистратор) Представление,
	|	Регистратор.Дата 		Дата,
	|	СуммаПриход				Дебет,
	|	СуммаРасход				Кредит
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.ОстаткиИОбороты(
	|			&ДатаНач, 
	|			&ДатаКон, 
	|			Регистратор, , 
	|		Организация 	= &Организация И
	|		Контрагент 		= &Контрагент 
	|	)
	|ГДЕ 
	|" + ?(Объект.Организация.ИНН = "781601216373", "", " ВЫБОР КОГДА Регистратор ССЫЛКА Документ.ВозвратОтПокупателя ТОГДА Регистратор.ОтражатьВБУ ИНАЧЕ ИСТИНА КОНЕЦ И ") + "
	|	ВЫБОР КОГДА Регистратор ССЫЛКА Документ.ПлатежноеПоручениеИсходящее ТОГДА Регистратор.ВидОперации <> ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщику) ИНАЧЕ ИСТИНА КОНЕЦ
	|	И НЕ ТИПЗНАЧЕНИЯ(Регистратор) В (&ТипыИсключения)
	|");
	
	// Акты строим только для партнеров как клиентов
	
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ВзаиморасчетыСПоставщиком"));
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	
	Запрос.УстановитьПараметр("ДатаНач", 		Объект.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКон", 		КонецДня(Объект.ДатаОкончания));
	Запрос.УстановитьПараметр("Организация", 	Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", 	Объект.Контрагент);
	Запрос.УстановитьПараметр("ТипыИсключения", МассивТипов);
	
	УстановитьПривилегированныйРежим(Истина);	
	Пакет = Запрос.ВыполнитьПакет();
	УстановитьПривилегированныйРежим(Ложь);	

	ТаблицаЗапроса = Пакет[1].Выгрузить();
	
	Объект.ОстатокНаНачало = Пакет[0].Выгрузить().Итог("ОстатокНаНачало");
	Объект.ПоДаннымОрганизации.Загрузить(ТаблицаЗапроса);
	
	ТаблицаЗапроса.Колонки.Дебет.Имя 		= "ПочтиКредит";
	ТаблицаЗапроса.Колонки.Кредит.Имя		= "Дебет";
	ТаблицаЗапроса.Колонки.ПочтиКредит.Имя 	= "Кредит";
	
	Объект.ПоДаннымКонтрагента.Загрузить(ТаблицаЗапроса);
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьСвои(Команда)
	
	
	
КонецПроцедуры
&НаКлиенте
Процедура ЗаполнитьЧужие(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаКлиенте
Процедура ДолгПарнераНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор, КлючНазначенияИспользования, СформироватьПриОткрытии", 
	 							Новый Структура("Контрагент", 
											Объект.Контрагент),,
								Истина);
								
	ОткрытьФорму("Отчет.ВзаиморасчетыПоПартнеру.ФормаОбъекта", ПараметрыФормы); 

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	
	ЗаполнитьТаблицуПоВзаиморасчетам();
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.ДатаНачала 		= Период.ДатаНачала;
	Объект.ДатаОкончания 	= Период.ДатаОкончания;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Период.ДатаНачала 		= ТекущийОбъект.ДатаНачала;
	Период.ДатаОкончания 	= ТекущийОбъект.ДатаОкончания;
	
КонецПроцедуры
